example/posts/rest-with-fastapi/rest-with-fastapi.html
<p>
FastAPI is a modern Python framework designed for speed and developer productivity. In this post, we will walk through the basics of creating and serving a simple API.
</p>
<div id="outline-container-org23d32de" class="outline-2">
<h2 id="org23d32de">Defining Routes</h2>
<div class="outline-text-2" id="text-org23d32de">
<p>
Lorem ipsum dolor sit amet, consectetur adipiscing elit. Donec viverra purus ac lectus maximus, at laoreet ligula tempor.
</p>
</div>
</div>
<div id="outline-container-org7fc8beb" class="outline-2">
<h2 id="org7fc8beb">Automatic Documentation</h2>
<div class="outline-text-2" id="text-org7fc8beb">
<p>
Mauris commodo, eros sit amet pulvinar consequat, lorem risus vestibulum neque, sed imperdiet odio turpis id velit.
</p>
</div>
</div>
